; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v5 ?v4)
             (pred_6 ?v8 ?v11)
             (pred_3 ?v5 ?v11)
             (pred_9 ?v9 ?v5 )
	     (pred_7 ?v5)
             (pred_1 ?v7)
             (pred_8 ?v8)
             (pred_12 ?v11)
             (pred_10 ?v5)
             (pred_4 ?v8)
             (pred_2 ?v5)
             (pred_5 ))



(:action op_4
:parameters (?v2 ?v3 ?v1 ?v12)
:precondition (and (pred_1 ?v2) (pred_1 ?v3) (pred_8 ?v1) (pred_12 ?v12)
          (pred_11 ?v2 ?v3) (pred_6 ?v1 ?v12)
                   (pred_3 ?v3 ?v12) (pred_7 ?v2) 
                   (pred_10 ?v3) (pred_4 ?v1))
:effect (and  (pred_2 ?v3) (not (pred_10 ?v3))))


(:action op_1
:parameters (?v2 ?v6)
:precondition (and (pred_1 ?v2) (pred_1 ?v6)
               (pred_7 ?v2) (pred_11 ?v2 ?v6) (pred_2 ?v6))
:effect (and (pred_7 ?v6) (not (pred_7 ?v2))))

(:action op_3
:parameters (?v2 ?v1)
:precondition (and (pred_1 ?v2) (pred_8 ?v1) 
                  (pred_7 ?v2) (pred_9 ?v1 ?v2) (pred_5 ))
:effect (and (pred_4 ?v1)
   (not (pred_9 ?v1 ?v2)) (not (pred_5 ))))


(:action op_5
:parameters (?v2 ?v10 ?v13)
:precondition (and (pred_1 ?v2) (pred_8 ?v10) (pred_8 ?v13)
                  (pred_7 ?v2) (pred_4 ?v13) (pred_9 ?v10 ?v2))
:effect (and (pred_4 ?v10) (pred_9 ?v13 ?v2)
        (not (pred_4 ?v13)) (not (pred_9 ?v10 ?v2))))

(:action op_2
:parameters (?v2 ?v1)
:precondition (and (pred_1 ?v2) (pred_8 ?v1) 
                  (pred_7 ?v2) (pred_4 ?v1))
:effect (and (pred_5 ) (pred_9 ?v1 ?v2) (not (pred_4 ?v1)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_02 obj_15 obj_14 obj_21 obj_18 obj_19 obj_09 obj_05 obj_01 obj_12 obj_11 obj_16 obj_06 obj_10 obj_17 obj_13
    obj_04 obj_08
    obj_20 obj_07 obj_03
    )

    (:init
       (pred_5)

       (pred_1 obj_02)
       (pred_1 obj_15)
       (pred_1 obj_14)
       (pred_1 obj_21)
       (pred_1 obj_18)
       (pred_1 obj_19)
       (pred_1 obj_09)
       (pred_1 obj_05)
       (pred_1 obj_01)
       (pred_1 obj_12)
       (pred_1 obj_11)
       (pred_1 obj_16)
       (pred_1 obj_06)
       (pred_1 obj_10)
       (pred_1 obj_17)
       (pred_1 obj_13)
       (pred_12 obj_04)
       (pred_12 obj_08)
       (pred_8 obj_20)
       (pred_8 obj_07)
       (pred_8 obj_03)

       (pred_11 obj_02 obj_18)
       (pred_11 obj_02 obj_15)
       (pred_11 obj_15 obj_19)
       (pred_11 obj_15 obj_14)
       (pred_11 obj_15 obj_02)
       (pred_11 obj_14 obj_09)
       (pred_11 obj_14 obj_21)
       (pred_11 obj_14 obj_15)
       (pred_11 obj_21 obj_05)
       (pred_11 obj_21 obj_14)
       (pred_11 obj_18 obj_01)
       (pred_11 obj_18 obj_19)
       (pred_11 obj_18 obj_02)
       (pred_11 obj_19 obj_12)
       (pred_11 obj_19 obj_09)
       (pred_11 obj_19 obj_15)
       (pred_11 obj_19 obj_18)
       (pred_11 obj_09 obj_11)
       (pred_11 obj_09 obj_05)
       (pred_11 obj_09 obj_14)
       (pred_11 obj_09 obj_19)
       (pred_11 obj_05 obj_16)
       (pred_11 obj_05 obj_21)
       (pred_11 obj_05 obj_09)
       (pred_11 obj_01 obj_06)
       (pred_11 obj_01 obj_12)
       (pred_11 obj_01 obj_18)
       (pred_11 obj_12 obj_10)
       (pred_11 obj_12 obj_11)
       (pred_11 obj_12 obj_19)
       (pred_11 obj_12 obj_01)
       (pred_11 obj_11 obj_17)
       (pred_11 obj_11 obj_16)
       (pred_11 obj_11 obj_09)
       (pred_11 obj_11 obj_12)
       (pred_11 obj_16 obj_13)
       (pred_11 obj_16 obj_05)
       (pred_11 obj_16 obj_11)
       (pred_11 obj_06 obj_10)
       (pred_11 obj_06 obj_01)
       (pred_11 obj_10 obj_17)
       (pred_11 obj_10 obj_12)
       (pred_11 obj_10 obj_06)
       (pred_11 obj_17 obj_13)
       (pred_11 obj_17 obj_11)
       (pred_11 obj_17 obj_10)
       (pred_11 obj_13 obj_16)
       (pred_11 obj_13 obj_17)
       (pred_10 obj_06)
       (pred_10 obj_21)
       (pred_10 obj_13)
       (pred_3  obj_06 obj_04)
       (pred_3  obj_21 obj_08)
       (pred_3  obj_13 obj_08)
       (pred_2 obj_02)
       (pred_2 obj_15)
       (pred_2 obj_14)
       (pred_2 obj_18)
       (pred_2 obj_19)
       (pred_2 obj_09)
       (pred_2 obj_05)
       (pred_2 obj_01)
       (pred_2 obj_12)
       (pred_2 obj_11)
       (pred_2 obj_16)
       (pred_2 obj_10)
       (pred_2 obj_17)

       (pred_6  obj_20 obj_04)
       (pred_6  obj_07 obj_08)
       (pred_6  obj_03 obj_08)
       (pred_9 obj_20 obj_05)
       (pred_9 obj_07 obj_02)
       (pred_9 obj_03 obj_18)
       (pred_7 obj_18)
    )

    (:goal (and
       (pred_9 obj_03 obj_13)
    ))
(:constraints
  (always (not (pred_7 obj_16)))
)
)

; plan
1. (op_3 obj_18 obj_03)
   deleted: (pred_9 obj_03 obj_18) (pred_5)
   added: (pred_4 obj_03)
   goals met: 0 of 1
2. (op_1 obj_18 obj_19)
   deleted: (pred_7 obj_18)
   added: (pred_7 obj_19)
   goals met: 0 of 1
3. (op_1 obj_19 obj_09)
   deleted: (pred_7 obj_19)
   added: (pred_7 obj_09)
   goals met: 0 of 1
4. (op_1 obj_09 obj_11)
   deleted: (pred_7 obj_09)
   added: (pred_7 obj_11)
   goals met: 0 of 1
5. (op_1 obj_11 obj_17)
   deleted: (pred_7 obj_11)
   added: (pred_7 obj_17)
   goals met: 0 of 1
6. (op_4 obj_17 obj_13 obj_03 obj_08)
   deleted: (pred_10 obj_13)
   added: (pred_2 obj_13)
   goals met: 0 of 1
7. (op_1 obj_17 obj_13)
   deleted: (pred_7 obj_17)
   added: (pred_7 obj_13)
   goals met: 0 of 1
8. (op_2 obj_13 obj_03)
   deleted: (pred_4 obj_03)
   added: (pred_5) (pred_9 obj_03 obj_13)
   goals met: 1 of 1
